---
kind: property
id: P:Autodesk.Revit.DB.Lighting.RectangleLightShape.EmitLength
source: html/40d4b78e-2da0-a0da-7d8d-7aae2a209fed.htm
---
# Autodesk.Revit.DB.Lighting.RectangleLightShape.EmitLength Property

The emit length.

## Syntax (C#)
```csharp
public double EmitLength { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.